Revit 2027 API
BuiltInFailures.BendFailures.DeleteMiddleBendNotAllowed Property
 Delete a middle bend in a bank is not allowed
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeleteMiddleBendNotAllowed { get; }
Public Shared ReadOnly Property DeleteMiddleBendNotAllowed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeleteMiddleBendNotAllowed {
	FailureDefinitionId^ get ();
}
static member DeleteMiddleBendNotAllowed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace